app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-01-09 13:43:27.542399"], ["updated_at", "2016-01-09 13:43:27.542399"]]

  def destroy
    @cart.destroy if @cart.id == session[:cart_id]
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]