app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-01-04 17:15:03.990174"], ["updated_at", "2016-01-04 17:15:03.990174"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", "2016-01-09 13:25:42.928202"], ["product_id", 2], ["updated_at", "2016-01-09 13:25:42.928202"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 1  [["quantity", 2], ["updated_at", "2016-01-12 15:38:01.721313"]]