app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-12-05 17:19:21.689719"], ["description", "ssd"], ["image_url", "dsds"], ["price", 0.0], ["title", "ss"], ["updated_at", "2015-12-05 17:19:21.689719"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = 3  [["description", "<p>CoffeeScript is JavaScript done right.It provides all of JavaScript's functionality wrapped in a cleaner,more succinct syntax."], ["updated_at", "2015-12-05 17:30:21.058292"]]