app/controllers/users_controller.rb

SELECT "users".* FROM "users"   ORDER BY "users"."name" ASC
---
  def index
    @users = User.order(:name)

SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])